## Production: eks
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`





```terraform
Plan: 5 to add, 2 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.notification-canada-ca-waf-logs will be created
  + resource "aws_cloudwatch_log_group" "notification-canada-ca-waf-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "aws-waf-logs-notification-canada-ca-waf"
      + retention_in_days = 7
      + tags              = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all          = {
          + "CostCenter" = "notification-canada-ca-production"
        }
    }

  # aws_cloudwatch_log_metric_filter.platform-admin-looking-at-sensitive-service-new will be created
  + resource "aws_cloudwatch_log_metric_filter" "platform-admin-looking-at-sensitive-service-new" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/application"
      + name           = "platform-admin-looking-at-sensitive-service-new"
      + pattern        = "\"Sensitive Admin API request\""

      + metric_transformation {
          + default_value = "0"
          + name          = "platform-admin-looking-at-sensitive-service-new"
          + namespace     = "LogMetrics"
          + unit          = "None"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.platform-admin-looking-at-sensitive-service-warning-new will be created
  + resource "aws_cloudwatch_metric_alarm" "platform-admin-looking-at-sensitive-service-warning-new" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "A platform admin is looking at a sensitive service on the admin (new)"
      + alarm_name                            = "platform-admin-looking-at-sensitive-service-warning-new"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "platform-admin-looking-at-sensitive-service-new"
      + namespace                             = "LogMetrics"
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.admin-api-50X-errors will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "admin-api-50X-errors" {
        id                  = "d90d86f4-f54f-4122-88bd-b3893cdb0af4"
        name                = "ADMIN & API - 50X errors"
      ~ query_string        = <<-EOT
            fields @timestamp, log, kubernetes.labels.app as app, kubernetes.pod_name as pod_name, @logStream
            | filter kubernetes.labels.app like /admin|api/
            | filter @message like /HTTP\/\d+\.\d+\\" 50\d/
            | sort @timestamp desc
            | limit 20
        EOT
        # (2 unchanged attributes hidden)
    }

  # aws_wafv2_regex_pattern_set.re_document_download will be created
  + resource "aws_wafv2_regex_pattern_set" "re_document_download" {
      + arn         = (known after apply)
      + description = "Regex matching valid document download endpoints"
      + id          = (known after apply)
      + lock_token  = (known after apply)
      + name        = "re_document_download"
      + scope       = "REGIONAL"
      + tags        = {
          + "CostCenter" = "notification-canada-ca-production"
        }
      + tags_all    = {
          + "CostCenter" = "notification-canada-ca-production"
        }

      + regular_expression {
          + regex_string = "/_status"
        }
      + regular_expression {
          + regex_string = "/services/[\\w]{8}-[\\w]{4}-[\\w]{4}-[\\w]{4}-[\\w]{12}/documents"
        }
      + regular_expression {
          + regex_string = "/services/[\\w]{8}-[\\w]{4}-[\\w]{4}-[\\w]{4}-[\\w]{12}/documents/[\\w]{8}-[\\w]{4}-[\\w]{4}-[\\w]{4}-[\\w]{12}"
        }
    }

  # aws_wafv2_web_acl.notification-canada-ca will be updated in-place
  ~ resource "aws_wafv2_web_acl" "notification-canada-ca" {
        id         = "0426a443-20b4-423d-be00-626fc7400dac"
        name       = "notification-canada-ca-waf"
        tags       = {
            "CostCenter" = "notification-canada-ca-production"
        }
        # (5 unchanged attributes hidden)


      + rule {
          + name     = "document_download_invalid_path"
          + priority = 10

          + action {

              + block {
                  + custom_response {
                      + response_code = 204
                    }
                }
            }

          + statement {
              + and_statement {
                  + statement {

                      + byte_match_statement {
                          + positional_constraint = "STARTS_WITH"
                          + search_string         = "api.document"

                          + field_to_match {

                              + single_header {
                                  + name = "host"
                                }
                            }

                          + text_transformation {
                              + priority = 1
                              + type     = "COMPRESS_WHITE_SPACE"
                            }
                          + text_transformation {
                              + priority = 2
                              + type     = "LOWERCASE"
                            }
                        }
                    }
                  + statement {

                      + not_statement {
                          + statement {

                              + regex_pattern_set_reference_statement {
                                  + arn = (known after apply)

                                  + field_to_match {

                                      + uri_path {}
                                    }

                                  + text_transformation {
                                      + priority = 1
                                      + type     = "COMPRESS_WHITE_SPACE"
                                    }
                                  + text_transformation {
                                      + priority = 2
                                      + type     = "LOWERCASE"
                                    }
                                }
                            }
                        }
                    }
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "document_download_api_invalid_path"
              + sampled_requests_enabled   = true
            }
        }
      - rule {
          - name     = "AWSManagedRulesAmazonIpReputationList" -> null
          - priority = 1 -> null

          - override_action {
              - count {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesAmazonIpReputationList" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesAmazonIpReputationList" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWSManagedRulesAmazonIpReputationList"
          + priority = 1

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesAmazonIpReputationList"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesAmazonIpReputationList"
              + sampled_requests_enabled   = true
            }
        }
      + rule {
          + name     = "AWSManagedRulesBotControlRuleSet"
          + priority = 6

          + override_action {
              + count {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesBotControlRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesBotControlRuleSet"
              + sampled_requests_enabled   = true
            }
        }
      - rule {
          - name     = "AWSManagedRulesKnownBadInputsRuleSet" -> null
          - priority = 3 -> null

          - override_action {
              - count {}
            }

          - statement {

              - managed_rule_group_statement {
                  - name        = "AWSManagedRulesKnownBadInputsRuleSet" -> null
                  - vendor_name = "AWS" -> null
                }
            }

          - visibility_config {
              - cloudwatch_metrics_enabled = true -> null
              - metric_name                = "AWSManagedRulesKnownBadInputsRuleSet" -> null
              - sampled_requests_enabled   = true -> null
            }
        }
      + rule {
          + name     = "AWSManagedRulesKnownBadInputsRuleSet"
          + priority = 3

          + override_action {

              + none {}
            }

          + statement {

              + managed_rule_group_statement {
                  + name        = "AWSManagedRulesKnownBadInputsRuleSet"
                  + vendor_name = "AWS"
                }
            }

          + visibility_config {
              + cloudwatch_metrics_enabled = true
              + metric_name                = "AWSManagedRulesKnownBadInputsRuleSet"
              + sampled_requests_enabled   = true
            }
        }

        # (5 unchanged blocks hidden)
    }

  # aws_wafv2_web_acl_logging_configuration.notification-canada-ca-waf-logs will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "notification-canada-ca-waf-logs" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = "arn:aws:wafv2:ca-central-1:296255494825:regional/webacl/notification-canada-ca-waf/0426a443-20b4-423d-be00-626fc7400dac"
    }

Plan: 5 to add, 2 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>